000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ШаблоныЧеков/ШаблоныЧеков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ШаблоныЧеков</name>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипШаблона</name>
    <type>
      <types>EnumRef.ТипыШаблоновЧеков</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтрокиПодвала</name>
    <attributes>
      <name>QRкод</name>
      <comment>Печатать QR код</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Строка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/РМКСервер/Module.bsl
#Область ПоддержкаРаботыСКупонами	//	LNK 06.09.2021 08:03:09

Функция ПолучитьШаблонЧека(Шаблон)	Экспорт

	СтрокиШаблона = Новый Массив;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТабличнаяЧасть.QRкод КАК QRкод,
	|	ТабличнаяЧасть.Строка КАК СтрокаТекста
	|ИЗ
	|	Справочник.ШаблоныЧеков.СтрокиПодвала КАК ТабличнаяЧасть
	|ГДЕ
	|	ТабличнаяЧасть.Ссылка = &Шаблон"
	);
	Запрос.УстановитьПараметр("Шаблон", Шаблон);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();

		Пока Выборка.Следующий() цикл

			СтрокиШаблона.Добавить(Новый Структура(
				"QRкод, СтрокаТекста"
				, Выборка.QRкод, СокрЛП(Выборка.СтрокаТекста))
			);

		КонецЦикла;

	КонецЕсли;

	Возврат СтрокиШаблона;

КонецФункции


#КонецОбласти
